HelTecAutomation/CubeCell-Arduino/boards.txt
menu.LORAWAN_REGION=LORAWAN_REGION
menu.LORAWAN_CLASS=LORAWAN_CLASS
menu.LORAWAN_DEVEUI=LORAWAN_DEVEUI
menu.LORAWAN_NETMODE=LORAWAN_NETMODE
menu.LORAWAN_ADR=LORAWAN_ADR
menu.LORAWAN_UPLINKMODE=LORAWAN_UPLINKMODE
menu.LORAWAN_Net_Reserve=LORAWAN_Net_Reservation
menu.LORAWAN_AT_SUPPORT=LORAWAN_AT_SUPPORT
menu.LORAWAN_RGB=LORAWAN_RGB
menu.LORAWAN_DebugLevel=LoRaWan Debug Level
##############################################################

CubeCell-Board.name=CubeCell-Board（HTCC-AB01）

CubeCell-Board.upload.tool=CubeCellflash
CubeCell-Board.upload.maximum_size=131072
CubeCell-Board.upload.maximum_data_size=131072
CubeCell-Board.upload.wait_for_upload_port=true

CubeCell-Board.build.board=CubeCell_Board
CubeCell-Board.build.core=asr650x
CubeCell-Board.build.mcu=ASR6501
CubeCell-Board.build.f_cpu=48000000L
CubeCell-Board.build.variant=CubeCell-Board

CubeCell-Board.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-Board.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-Board.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-Board.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-Board.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-Board.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-Board.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-Board.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-Board.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-Board.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-Board.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-Board.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-Board.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-Board.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-Board.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-Board.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-Board.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-Board.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-Board.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-Board.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-Board.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-Board.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-Board.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-Board.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-Board.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-Board.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-Board.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-Board.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-Board.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-Board.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-Board.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-Board.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

CubeCell-Board.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-Board.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-Board.menu.LORAWAN_NETMODE.1=ABP
CubeCell-Board.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-Board.menu.LORAWAN_ADR.0=ON
CubeCell-Board.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-Board.menu.LORAWAN_ADR.1=OFF
CubeCell-Board.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-Board.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-Board.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-Board.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-Board.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-Board.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-Board.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-Board.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-Board.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-Board.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-Board.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-Board.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-Board.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-Board.menu.LORAWAN_RGB.1=ACTIVE
CubeCell-Board.menu.LORAWAN_RGB.1.build.RGB=1
CubeCell-Board.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-Board.menu.LORAWAN_RGB.0.build.RGB=0

CubeCell-Board.menu.LORAWAN_DebugLevel.0=None
CubeCell-Board.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-Board.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-Board.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-Board.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-Board.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2
##############################################################

CubeCell-Capsule.name=CubeCell-Capsule（HTCC-AC0X）

CubeCell-Capsule.upload.tool=CubeCellflash
CubeCell-Capsule.upload.maximum_size=131072
CubeCell-Capsule.upload.maximum_data_size=131072
CubeCell-Capsule.upload.wait_for_upload_port=true

CubeCell-Capsule.build.board=CubeCell_Capsule
CubeCell-Capsule.build.core=asr650x
CubeCell-Capsule.build.mcu=ASR6501
CubeCell-Capsule.build.f_cpu=48000000L
CubeCell-Capsule.build.variant=CubeCell-Capsule

CubeCell-Capsule.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-Capsule.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-Capsule.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-Capsule.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-Capsule.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-Capsule.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-Capsule.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-Capsule.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-Capsule.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-Capsule.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-Capsule.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-Capsule.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-Capsule.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-Capsule.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-Capsule.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-Capsule.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-Capsule.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-Capsule.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-Capsule.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-Capsule.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-Capsule.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-Capsule.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-Capsule.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-Capsule.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-Capsule.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-Capsule.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-Capsule.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-Capsule.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-Capsule.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-Capsule.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-Capsule.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-Capsule.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

